

/** ====================================================================== */
/**                                                                        */
/** ============================ 通知 公告 组件 ============================== */
/**                                                                        */
/** ====================================================================== */

Component({
  /** ==================================================== */
  /** ================= 组件数据 Start ==================== */
  /** ==================================================== */
  /**
   * 组件的属性列表
   */
  properties: {
    showCloseBtn: {
      type: Boolean,
      value: false,
    }, // 是否显示关闭按钮
    showIcon:{
      type: Boolean,
      value: true,
    }, // 是否展示 icon
    iconType: {
      type: String,
      value: null,
    }, // 图标类型 有就会显示图标
    iconSize: {
      type: Number,
      value: 40,
    }, // 图标大小
    iconColor: {
      type: String,
      value: "#ee2c2c",
    }, // 图标颜色
    iconCustom: {
      type: String,
      value: null,
    }, // 自定义 icon
    notices: {
      type: Array,
      value: null,
    }, // 通知内容
  },

  /**
   * 组件的初始数据 内部属性
   */
  data: {
    show: true,
  },

  /**
   * 属性监听
   */
  observers: {

  },

  /** ==================================================== */
  /** ================= 组件数据 End ==================== */
  /** ==================================================== */

  /** ==================================================== */
  /** ================= 方法 Start ==================== */
  /** ==================================================== */

  /**
   * 组件的方法列表
   */
  methods: {

  },

  /** ==================================================== */
  /** ================= 方法 End ==================== */
  /** ==================================================== */

  /** ==================================================== */
  /** ================= 生命周期 Start ==================== */
  /** ==================================================== */
  created: function () {
    // 在组件实例刚刚被创建时执行
  },
  attached: function () {
    // 在组件实例进入页面节点树时执行
  },
  ready: function () {
    // 在组件在视图层布局完成后执行
  },
  moved: function () {
    // 在组件实例被移动到节点树另一个位置时执行
  },
  detached: function () {
    // 在组件实例被从页面节点树移除时执行
  },
  error: function () {
    // 每当组件方法抛出错误时执行
  },
  /**
   * 生命周期
   */
  lifeTimes: {
    created: function () {
      // 在组件实例刚刚被创建时执行
    },
    attached: function () {
      // 在组件实例进入页面节点树时执行
    },
    ready: function () {
      // 在组件在视图层布局完成后执行
    },
    moved: function () {
      // 在组件实例被移动到节点树另一个位置时执行
    },
    detached: function () {
      // 在组件实例被从页面节点树移除时执行
    },
    error: function () {
      // 每当组件方法抛出错误时执行
    },
  },
  /**
   * 组件所在页面的生命周期
   */
  pageLifetimes: {
    show: function () {
      // 页面被展示
    },
    hide: function () {
      // 页面被隐藏
    },
    resize: function (size) {
      // 页面尺寸变化
    }
  },

  /** ==================================================== */
  /** ================= 生命周期 End ==================== */
  /** ==================================================== */

  /** ==================================================== */
  /** ================= 样式 Start ==================== */
  /** ==================================================== */

  /**
   * 外部样式类
   */
  externalClasses: ["i-class"],

  /** ==================================================== */
  /** ================= 样式 End ==================== */
  /** ==================================================== */
})
